In [1]:
import sqlite3
import seaborn as sns
import pandas as pd

In [2]:
dataset_df = pd.read_csv('Dataset Superstore - BI Analyst - Order.csv')
dataset_df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Country,City,State,Postal Code,Region,Product ID,Sales,Quantity,Discount,Profit
0,3,CA-2016-138688,6/12/2016,6/16/2016,Second Class,DV-13045,United States,Los Angeles,California,90036,West,OFF-LA-10000240,14.6200,2,0.00,6.8714
1,4,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,United States,Fort Lauderdale,Florida,33311,South,FUR-TA-10000577,957.5775,5,0.45,-383.0310
2,5,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,United States,Fort Lauderdale,Florida,33311,South,OFF-ST-10000760,22.3680,2,0.20,2.5164
3,6,CA-2014-115812,6/9/2014,6/14/2014,Standard Class,BH-11710,United States,Los Angeles,California,90032,West,FUR-FU-10001487,48.8600,7,0.00,14.1694
4,7,CA-2014-115812,6/9/2014,6/14/2014,Standard Class,BH-11710,United States,Los Angeles,California,90032,West,OFF-AR-10002833,7.2800,4,0.00,1.9656

In [7]:
cursor = connection.cursor()

In [11]:
dataset_df.info

<bound method DataFrame.info of       Row ID        Order ID  Order Date   Ship Date       Ship Mode  \
0          3  CA-2016-138688   6/12/2016   6/16/2016    Second Class
1          4  US-2015-108966  10/11/2015  10/18/2015  Standard Class
2          5  US-2015-108966  10/11/2015  10/18/2015  Standard Class
3          6  CA-2014-115812    6/9/2014   6/14/2014  Standard Class
4          7  CA-2014-115812    6/9/2014   6/14/2014  Standard Class
...      ...             ...         ...         ...             ...
9989       1  CA-2016-152156   11/8/2016  11/11/2016    Second Class
9990       2  CA-2016-152156   11/8/2016  11/11/2016    Second Class
9991    5492  CA-2017-164098   1/26/2017   1/27/2017     First Class
9992    6878  US-2015-123918  10/15/2015  10/15/2015        Same Day
9993    6879  US-2015-123918  10/15/2015  10/15/2015        Same Day

     Customer ID        Country             City       State  Postal Code  \
0       DV-13045  United States      Los Angeles  California        90036
1       SO-20335  United States  Fort Lauderdale     Florida        33311
2       SO-20335  United States  Fort Lauderdale     Florida        33311
3       BH-11710  United States      Los Angeles  California        90032
4       BH-11710  United States      Los Angeles  California        90032
...          ...            ...              ...         ...          ...
9989    CG-12520  United States        Henderson    Kentucky        42420
9990    CG-12520  United States        Henderson    Kentucky        42420
9991    CG-12520  United States          Houston       Texas        77070
9992    CG-12520  United States           Dallas       Texas        75217
9993    CG-12520  United States           Dallas       Texas        75217

       Region       Product ID     Sales  Quantity  Discount    Profit
0        West  OFF-LA-10000240   14.6200         2      0.00    6.8714
1       South  FUR-TA-10000577  957.5775         5      0.45 -383.0310
2       South  OFF-ST-10000760   22.3680         2      0.20    2.5164
3        West  FUR-FU-10001487   48.8600         7      0.00   14.1694
4        West  OFF-AR-10002833    7.2800         4      0.00    1.9656
...       ...              ...       ...       ...       ...       ...
9989   Southn  FUR-BO-10001798  261.9600         2      0.00   41.9136
9990    South  FUR-CH-10000454  731.9400         3      0.00  219.5820
9991  Central  OFF-ST-10000615   18.1600         2      0.20    1.8160
9992  Central  FUR-FU-10004952  131.3760         6      0.60  -95.2476
9993  Central  OFF-PA-10003001    5.3440         1      0.20    1.8704

[9994 rows x 16 columns]>

In [8]:
x = cursor.description

In [12]:
dataset_df.description

AttributeError: 'DataFrame' object has no attribute 'description'

In [13]:
dataset_df.describe

<bound method NDFrame.describe of       Row ID        Order ID  Order Date   Ship Date       Ship Mode  \
0          3  CA-2016-138688   6/12/2016   6/16/2016    Second Class
1          4  US-2015-108966  10/11/2015  10/18/2015  Standard Class
2          5  US-2015-108966  10/11/2015  10/18/2015  Standard Class
3          6  CA-2014-115812    6/9/2014   6/14/2014  Standard Class
4          7  CA-2014-115812    6/9/2014   6/14/2014  Standard Class
...      ...             ...         ...         ...             ...
9989       1  CA-2016-152156   11/8/2016  11/11/2016    Second Class
9990       2  CA-2016-152156   11/8/2016  11/11/2016    Second Class
9991    5492  CA-2017-164098   1/26/2017   1/27/2017     First Class
9992    6878  US-2015-123918  10/15/2015  10/15/2015        Same Day
9993    6879  US-2015-123918  10/15/2015  10/15/2015        Same Day

     Customer ID        Country             City       State  Postal Code  \
0       DV-13045  United States      Los Angeles  California        90036
1       SO-20335  United States  Fort Lauderdale     Florida        33311
2       SO-20335  United States  Fort Lauderdale     Florida        33311
3       BH-11710  United States      Los Angeles  California        90032
4       BH-11710  United States      Los Angeles  California        90032
...          ...            ...              ...         ...          ...
9989    CG-12520  United States        Henderson    Kentucky        42420
9990    CG-12520  United States        Henderson    Kentucky        42420
9991    CG-12520  United States          Houston       Texas        77070
9992    CG-12520  United States           Dallas       Texas        75217
9993    CG-12520  United States           Dallas       Texas        75217

       Region       Product ID     Sales  Quantity  Discount    Profit
0        West  OFF-LA-10000240   14.6200         2      0.00    6.8714
1       South  FUR-TA-10000577  957.5775         5      0.45 -383.0310
2       South  OFF-ST-10000760   22.3680         2      0.20    2.5164
3        West  FUR-FU-10001487   48.8600         7      0.00   14.1694
4        West  OFF-AR-10002833    7.2800         4      0.00    1.9656
...       ...              ...       ...       ...       ...       ...
9989   Southn  FUR-BO-10001798  261.9600         2      0.00   41.9136
9990    South  FUR-CH-10000454  731.9400         3      0.00  219.5820
9991  Central  OFF-ST-10000615   18.1600         2      0.20    1.8160
9992  Central  FUR-FU-10004952  131.3760         6      0.60  -95.2476
9993  Central  OFF-PA-10003001    5.3440         1      0.20    1.8704

[9994 rows x 16 columns]>

In [61]:
# Create connection to sqlite database
connection = sqlite3.connect('Dataset.db') # jadi disini kita ubah data yang kita miliki menjadi db

In [20]:
# Insert taxis dataframe into sqlite database using to_sql method
dataset_df.to_sql("Dataset.db", connection)

9994

In [21]:
pd.read_sql("SELECT*FROM Dataset", connection)

,index,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Country,City,State,Postal Code,Region,Product ID,Sales,Quantity,Discount,Profit
0,0,3,CA-2016-138688,6/12/2016,6/16/2016,Second Class,DV-13045,United States,Los Angeles,California,90036,West,OFF-LA-10000240,14.6200,2,0.00,6.8714
1,1,4,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,United States,Fort Lauderdale,Florida,33311,South,FUR-TA-10000577,957.5775,5,0.45,-383.0310
2,2,5,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,United States,Fort Lauderdale,Florida,33311,South,OFF-ST-10000760,22.3680,2,0.20,2.5164
3,3,6,CA-2014-115812,6/9/2014,6/14/2014,Standard Class,BH-11710,United States,Los Angeles,California,90032,West,FUR-FU-10001487,48.8600,7,0.00,14.1694
4,4,7,CA-2014-115812,6/9/2014,6/14/2014,Standard Class,BH-11710,United States,Los Angeles,California,90032,West,OFF-AR-10002833,7.2800,4,0.00,1.9656
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9989,1,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,United States,Henderson,Kentucky,42420,Southn,FUR-BO-10001798,261.9600,2,0.00,41.9136
9990,9990,2,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,United States,Henderson,Kentucky,42420,South,FUR-CH-10000454,731.9400,3,0.00,219.5820
9991,9991,5492,CA-2017-164098,1/26/2017,1/27/2017,First Class,CG-12520,United States,Houston,Texas,77070,Central,OFF-ST-10000615,18.1600,2,0.20,1.8160
9992,9992,6878,US-2015-123918,10/15/2015,10/15/2015,Same Day,CG-12520,United States,Dallas,Texas,75217,Central,FUR-FU-10004952,131.3760,6,0.60,-95.2476
9993,9993,6879,US-2015-123918,10/15/2015,10/15/2015,Same Day,CG-12520,United States,Dallas,Texas,75217,Central,OFF-PA-10003001,5.3440,1,0.20,1.8704

## 1.Menghitung Jumlah seluruh produk yang terjual

In [19]:
query = """
SELECT SUM(Quantity) AS jumlah_produk_terjual
FROM Dataset
"""
pd.read_sql(query, connection)

   jumlah_produk_terjual
0                  37873

catatan kalau mau menghitung nilai yang unik menggunakan distinct sehingga menghitung yang tidak sama

## 2. Menghitung Jumlah unique customer yang telah memesan produk

In [136]:
query = """
SELECT COUNT(DISTINCT"Customer ID") AS jumlah_unique_customer
FROM Dataset
"""
pd.read_sql(query, connection)

   jumlah_unique_customer
0                     793

In [138]:
query = """
SELECT AVG(Profit) AS rata_rata_profit
FROM Dataset
"""
pd.read_sql(query, connection)

   rata_rata_profit
0         28.656896

## 3.  Menghitung Rata-rata profit dari seluruh order (dalam mata uang)

In [43]:
query = """
SELECT AVG(Profit) AS rata_rata_profit
FROM Dataset
WHERE Profit > 0
"""
pd.read_sql(query, connection)

   rata_rata_profit
0         54.917884

## 4. Mencari discount terkecil dari seluruh order

In [140]:
query = """
SELECT MIN(Discount) AS dscount_terkecil
FROM Dataset
"""
pd.read_sql(query, connection)

   dscount_terkecil
0               0.0

In [48]:
# menceri discount terkecil dari seluruh order
query = """
SELECT MIN(Discount) AS dscount_terkecil
FROM Dataset
WHERE Discount > 0
"""
pd.read_sql(query, connection)

   dscount_terkecil
0               0.1

bedanya count dan sum kalau count menghitung benda sedangkan
sum menghitung dalam bentuk angka

## percobaan

## 5. Jumlah seluruh produk dari kategori Furniture

In [103]:
query = """
SELECT COUNT(DISTINCT"Product ID") AS jumlah_produk_kategori_furniture
FROM Dataset
WHERE "Product ID" LIKE 'FUR%'
"""
pd.read_sql(query, connection)

   jumlah_produk_kategori_furniture
0                               375

In [115]:
query = """
SELECT COUNT(DISTINCT"Product ID") AS jumlah_produk_kategori_furniture
FROM Dataset
WHERE "Product ID" LIKE 'TEC%'
"""
pd.read_sql(query, connection)

   jumlah_produk_kategori_furniture
0                               404

In [104]:
query = """
SELECT COUNT(DISTINCT"Product ID") AS jumlah_produk_kategori_furniture
FROM Dataset
WHERE "Product ID" LIKE 'OFF%'
"""
pd.read_sql(query, connection)

   jumlah_produk_kategori_furniture
0                              1083

In [105]:
query = """
SELECT COUNT(DISTINCT"Product ID") AS jumlah_produk_kategori_furniture
FROM Dataset
WHERE "Product ID" LIKE 'FUR%' OR "Product ID" LIKE 'OFF%'
"""
pd.read_sql(query, connection)

   jumlah_produk_kategori_furniture
0                              1458

In [113]:
query = '''
SELECT DISTINCT SUBSTR("Product ID", 1, 3) AS unique_prefix
FROM Dataset
WHERE LENGTH("Product ID") >= 6
'''
pd.read_sql(query, connection)

  unique_prefix
0           OFF
1           FUR
2           TEC

In [114]:
query = """
SELECT SUBSTR("Product ID", 1, 3) AS unique_prefix, COUNT(*) AS total
FROM Dataset
WHERE LENGTH("Product ID") >= 6
GROUP BY unique_prefix
"""
pd.read_sql(query, connection)

  unique_prefix  total
0           FUR   2121
1           OFF   6026
2           TEC   1847

In [107]:
query = '''
SELECT DISTINCT LEFT("Product ID", 3) AS unique_prefix
FROM Dataset
WHERE LEN("Product ID") >= 6
'''
pd.read_sql(query, connection)

DatabaseError: Execution failed on sql '
SELECT DISTINCT LEFT("Product ID", 3) AS unique_prefix
FROM Dataset
WHERE LEN("Product ID") >= 6
': near "(": syntax error

In [51]:
# Menjumlah seluruh produk dari kategori Furniture
query = """
SELECT COUNT("Product ID") AS jumlah_produk_kategori_furniture
FROM Dataset
WHERE "Product ID" LIKE 'FUR%'
"""
pd.read_sql(query, connection)

   jumlah_produk_kategori_furniture
0                              2121

## 6. Nama pelanggan yang membeli produk paling banyak (dalam quantity)

In [53]:
# Nama pelanggan yang membeli produk paling banyak (dalam quantity)
query = """
SELECT "Customer ID", SUM(Quantity) AS total_quantity
FROM Dataset
GROUP BY "Customer ID"
ORDER BY total_quantity DESC
LIMIT 1
"""
pd.read_sql(query, connection)

  Customer ID  total_quantity
0    JD-15895             150

In [76]:
query = """
SELECT "Customer ID", SUM(Quantity)  AS total_belanjaan
FROM Dataset
"""
pd.read_sql(query, connection)

  Customer ID  total_belanjaan
0    DV-13045            37873

In [62]:
query = """
SELECT "Customer ID", SUM(Quantity)  AS total_belanjaan
FROM Dataset
GROUP BY "Customer ID"
LIMIT 1
"""
pd.read_sql(query, connection)

  Customer ID  total_belanjaan
0    AA-10315               30

In [66]:
query = """
SELECT "Customer ID", SUM(Quantity) AS total_quantity
FROM Dataset
GROUP BY "Customer ID"
ORDER BY total_quantity
LIMIT 1
"""
pd.read_sql(query, connection)

  Customer ID  total_quantity
0    AO-10810               2

In [65]:
query = """
SELECT "Customer ID", SUM(Quantity) AS total_quantity
FROM Dataset
GROUP BY "Customer ID"
"""
pd.read_sql(query, connection)

    Customer ID  total_quantity
0      AA-10315              30
1      AA-10375              41
2      AA-10480              39
3      AA-10645              64
4      AB-10015              13
..          ...             ...
788    XP-21865             100
789    YC-21895              31
790    YS-21880              58
791    ZC-21910             105
792    ZD-21925              32

[793 rows x 2 columns]

In [68]:
query = """
SELECT "Customer ID", SUM(Quantity) AS total_quantity
FROM Dataset
GROUP BY "Customer ID"
ORDER BY total_quantity DESC
"""
pd.read_sql(query, connection)

    Customer ID  total_quantity
0      JD-15895             150
1      WB-21850             146
2      JL-15835             143
3      PP-18955             138
4      SC-20725             133
..          ...             ...
788    TS-21085               4
789    RM-19750               4
790    LD-16855               3
791    JR-15700               3
792    AO-10810               2

[793 rows x 2 columns]

## 7. Nama pelanggan yang paling sering melakukan repeat order

In [69]:
# mencari Nama pelanggan yang paling sering melakukan repeat order
query = """
SELECT "Customer ID", COUNT(*) AS jumlah_repeat_order
FROM Dataset
GROUP BY "Customer ID"
HAVING COUNT(*) > 1
ORDER BY jumlah_repeat_order DESC
"""
pd.read_sql(query, connection)

    Customer ID  jumlah_repeat_order
0      WB-21850                   37
1      PP-18955                   34
2      MA-17560                   34
3      JL-15835                   34
4      SV-20365                   32
..          ...                  ...
783    NB-18580                    2
784    MG-18205                    2
785    EL-13735                    2
786    BO-11425                    2
787    AR-10570                    2

[788 rows x 2 columns]

In [70]:
query = """
SELECT "Customer ID", COUNT(*) AS jumlah_repeat_order
FROM Dataset
GROUP BY "Customer ID"
HAVING COUNT(*) > 1
ORDER BY jumlah_repeat_order DESC
LIMIT 1
"""
pd.read_sql(query, connection)

  Customer ID  jumlah_repeat_order
0    WB-21850                   37

In [75]:
query = """
SELECT "Customer ID", City , COUNT(*) AS jumlah_repeat_order
FROM Dataset
GROUP BY "Customer ID"
HAVING COUNT(*) > 1
ORDER BY jumlah_repeat_order DESC
LIMIT 1
"""
pd.read_sql(query, connection)

  Customer ID          City  jumlah_repeat_order
0    WB-21850  Philadelphia                   37

## 8. Dari kota mana pelanggan yang paling sering melakukan repeat order

In [76]:
# Dari kota mana pelanggan yang paling sering melakukan repeat order
query = """
SELECT City, COUNT(*) AS jumlah_repeat_order
FROM Dataset
GROUP BY City
HAVING COUNT(*) > 1
ORDER BY jumlah_repeat_order DESC
LIMIT 1
"""
pd.read_sql(query, connection)

            City  jumlah_repeat_order
0  New York City                  915

## 9. Order mana yang mendapatkan total discount paling kecil

In [80]:
# Order mana yang mendapatkan total discount paling kecil
query = """
SELECT "Order ID", MIN(Discount) AS discount_terkecil
FROM Dataset
"""
pd.read_sql(query, connection)

         Order ID  discount_terkecil
0  CA-2016-138688                0.0

In [144]:
query = """
SELECT "Order ID", (Discount) AS discount_terkecil
FROM Dataset
ORDER BY discount_terkecil
"""
pd.read_sql(query, connection)

            Order ID  discount_terkecil
0     CA-2016-138688                0.0
1     CA-2014-115812                0.0
2     CA-2014-115812                0.0
3     CA-2014-115812                0.0
4     CA-2014-105893                0.0
...              ...                ...
9989  CA-2014-127166                0.8
9990  CA-2016-125920                0.8
9991  CA-2017-145093                0.8
9992  CA-2016-126627                0.8
9993  CA-2016-149272                0.8

[9994 rows x 2 columns]

In [81]:
query = """
SELECT "Order ID", MIN(Discount) AS discount_terkecil
FROM Dataset
WHERE Discount > 0
"""
pd.read_sql(query, connection)

         Order ID  discount_terkecil
0  CA-2016-111682                0.1

In [146]:
query = """
SELECT "Order ID",(Discount) AS discount_terkecil
FROM Dataset
WHERE Discount = 0.1
"""
pd.read_sql(query, connection)

          Order ID  discount_terkecil
0   CA-2016-111682                0.1
1   CA-2014-164973                0.1
2   CA-2017-144904                0.1
3   CA-2017-157252                0.1
4   CA-2015-138009                0.1
..             ...                ...
89  CA-2016-116596                0.1
90  CA-2017-152975                0.1
91  CA-2014-156160                0.1
92  CA-2016-105781                0.1
93  CA-2016-122581                0.1

[94 rows x 2 columns]

In [83]:
query = """
SELECT COUNT(DISTINCT "Produk ID") AS jumlah_produk
FROM Dataset
"""
pd.read_sql(query, connection)

   jumlah_produk
0              1

In [95]:
query = """
SELECT COUNT(DISTINCT LEFT "Product ID", 3) AS jumlah_produk_unik
FROM Dataset
"""
pd.read_sql (query, connection)

DatabaseError: Execution failed on sql '
SELECT COUNT(DISTINCT LEFT "Product ID", 3) AS jumlah_produk_unik
FROM Dataset
': near ""Product ID"": syntax error

## 10. Total profit yang datang dari produk dengan sub category Furnishings & Supplies

In [117]:
# Menghitung Total profit yang datang dari produk dengan sub category Furnishings & Supplies
query = """
SELECT SUBSTR("Product ID", 1, 3) AS unique_prefix, SUM(Profit) AS total_profit
FROM Dataset
WHERE LENGTH("Product ID") >= 6 AND Profit > 0
GROUP BY unique_prefix
"""
pd.read_sql(query, connection)

  unique_prefix  total_profit
0           FUR    79387.3818
1           OFF   179106.0593
2           TEC   184034.8663

In [120]:
query = """
SELECT SUM(Profit) AS total_profit
FROM Dataset
WHERE Profit > 0
"""
pd.read_sql(query, connection)

   total_profit
0   442528.3074

In [121]:
query = """
SELECT COUNT(Profit) AS total_profit
FROM Dataset
WHERE Profit > 0
"""
pd.read_sql(query, connection)

   total_profit
0          8058

In [122]:
query = """
SELECT COUNT(Profit) AS total_profit
FROM Dataset
WHERE Profit < 0
"""
pd.read_sql(query, connection)

   total_profit
0          1871

In [123]:
query = """
SELECT COUNT(Profit) AS total_profit
FROM Dataset
WHERE Profit = 0
"""
pd.read_sql(query, connection)

   total_profit
0            65

SELECT SUM(profit) AS total_profit
FROM Dataset
WHERE SUBSTR("Product ID", 5, 3) = 'FU';

## 10 Sub CATAGORY FURNISHINGS

In [38]:
# Menghitung Total profit yang datang dari produk dengan sub category Furnishings
query = """
SELECT (Profit) AS total_profit
FROM Dataset
WHERE SUBSTR("Product ID", 1, 6) = 'FUR-FU'
"""
pd.read_sql(query, connection)

     total_profit
0         14.1694
1         15.5250
2       -147.9630
3          2.9568
4         22.3328
..            ...
952       19.9155
953        6.4320
954        4.1028
955       15.6332
956      -95.2476

[957 rows x 1 columns]

In [40]:
# Menghitung Total profit yang datang dari produk dengan sub category Furnishings
query = """
SELECT SUM(Profit) AS total_profit
FROM Dataset
WHERE SUBSTR("Product ID", 1, 6) = 'FUR-FU' AND Profit > 0
"""
pd.read_sql(query, connection)

   total_profit
0     19550.057

In [36]:
# Menghitung Total profit yang datang dari produk dengan sub category Furnishings
query = """
SELECT SUM(Profit) AS total_profit
FROM Dataset
WHERE SUBSTR("Product ID", 1, 6) = 'FUR-FU'
"""
pd.read_sql(query, connection)

   total_profit
0    13059.1436

## 10 Sub CATAGORY SUPPLIES

In [37]:
# Menghitung Total profit yang datang dari produk dengan sub category supplies
query = """
SELECT SUM(Profit) AS total_profit
FROM Dataset
WHERE SUBSTR("Product ID", 1, 6) = 'OFF-SU'
"""
pd.read_sql(query, connection)

   total_profit
0    -1189.0995

In [42]:
# Menghitung Total profit yang datang dari produk dengan sub category supplies
query = """
SELECT SUM(Profit) AS total_profit
FROM Dataset
WHERE SUBSTR("Product ID", 1, 6) = 'OFF-SU' AND Profit > 0
"""
pd.read_sql(query, connection)

   total_profit
0     1826.5224

In [41]:
# Menghitung Total profit yang datang dari produk dengan sub category supplies
query = """
SELECT (Profit) AS total_profit
FROM Dataset
WHERE SUBSTR("Product ID", 1, 6) = 'OFF-SU'
"""
pd.read_sql(query, connection)

     total_profit
0         18.4464
1         -3.7715
2       -204.3145
3          0.1472
4         21.0360
..            ...
185        0.0636
186        9.9456
187       13.2990
188        2.1900
189       16.1240

[190 rows x 1 columns]

In [127]:
# Menghitung Total profit yang datang dari produk dengan sub category Furnishings & Supplies
query = """
SELECT SUBSTR("Product ID", 5, 2) AS unique_prefix 
FROM Dataset
GROUP BY unique_prefix
"""
pd.read_sql(query, connection)

   unique_prefix
0             AC
1             AP
2             AR
3             BI
4             BO
5             CH
6             CO
7             EN
8             FA
9             FU
10            LA
11            MA
12            PA
13            PH
14            ST
15            SU
16            TA

In [130]:
query ='''
SELECT COUNT(*) AS jumlah_order
FROM Dataset
WHERE "Order Date" = "Ship Date"
'''
pd.read_sql(query, connection)

   jumlah_order
0           519

## 12. Jumlah order yang memiliki waktu pengiriman masih di hari yang sama dengan waktu pemesanan

In [134]:
query = '''
SELECT "Order Date", "Ship Date", City
FROM Dataset
WHERE "Order Date" = "Ship Date"
'''
pd.read_sql(query, connection)

     Order Date   Ship Date           City
0    10/21/2016  10/21/2016     Manchester
1    10/21/2016  10/21/2016     Manchester
2    10/21/2016  10/21/2016     Manchester
3    10/21/2016  10/21/2016     Manchester
4     9/19/2016   9/19/2016         Aurora
..          ...         ...            ...
514    9/4/2016    9/4/2016  San Francisco
515    9/4/2016    9/4/2016  San Francisco
516   7/26/2015   7/26/2015   Philadelphia
517  10/15/2015  10/15/2015         Dallas
518  10/15/2015  10/15/2015         Dallas

[519 rows x 3 columns]

## Menggabungkan CSV tabel katagori dengan tabel order

In [47]:
dataset_df = pd.read_csv('Dataset Superstore - BI Analyst - Order.csv')
dataset_df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Country,City,State,Postal Code,Region,Product ID,Sales,Quantity,Discount,Profit
0,3,CA-2016-138688,6/12/2016,6/16/2016,Second Class,DV-13045,United States,Los Angeles,California,90036,West,OFF-LA-10000240,14.6200,2,0.00,6.8714
1,4,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,United States,Fort Lauderdale,Florida,33311,South,FUR-TA-10000577,957.5775,5,0.45,-383.0310
2,5,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,United States,Fort Lauderdale,Florida,33311,South,OFF-ST-10000760,22.3680,2,0.20,2.5164
3,6,CA-2014-115812,6/9/2014,6/14/2014,Standard Class,BH-11710,United States,Los Angeles,California,90032,West,FUR-FU-10001487,48.8600,7,0.00,14.1694
4,7,CA-2014-115812,6/9/2014,6/14/2014,Standard Class,BH-11710,United States,Los Angeles,California,90032,West,OFF-AR-10002833,7.2800,4,0.00,1.9656

In [43]:
dataset_dc = pd.read_csv('Dataset Superstore - BI Analyst - Categories.csv')
dataset_dc.head()

,Product ID,Category,Sub-Category,Product Name
0,FUR-BO-10000112,Furniture,Bookcases,"Bush Birmingham Collection Bookcase, Dark Cherry"
1,FUR-BO-10000330,Furniture,Bookcases,"Sauder Camden County Barrister Bookcase, Plank..."
2,FUR-BO-10000362,Furniture,Bookcases,Sauder Inglewood Library Bookcases
3,FUR-BO-10000468,Furniture,Bookcases,O'Sullivan 2-Shelf Heavy-Duty Bookcases
4,FUR-BO-10000711,Furniture,Bookcases,"Hon Metal Bookcases, Gray"

In [51]:
merged_df = pd.concat([dataset_df, dataset_dc], ignore_index=True)
merged_df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Country,City,State,Postal Code,Region,Product ID,Sales,Quantity,Discount,Profit,Category,Sub-Category,Product Name
0,3.0,CA-2016-138688,6/12/2016,6/16/2016,Second Class,DV-13045,United States,Los Angeles,California,90036.0,West,OFF-LA-10000240,14.6200,2.0,0.00,6.8714,NaN,NaN,NaN
1,4.0,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,United States,Fort Lauderdale,Florida,33311.0,South,FUR-TA-10000577,957.5775,5.0,0.45,-383.0310,NaN,NaN,NaN
2,5.0,US-2015-108966,10/11/2015,10/18/2015,Standard Class,SO-20335,United States,Fort Lauderdale,Florida,33311.0,South,OFF-ST-10000760,22.3680,2.0,0.20,2.5164,NaN,NaN,NaN
3,6.0,CA-2014-115812,6/9/2014,6/14/2014,Standard Class,BH-11710,United States,Los Angeles,California,90032.0,West,FUR-FU-10001487,48.8600,7.0,0.00,14.1694,NaN,NaN,NaN
4,7.0,CA-2014-115812,6/9/2014,6/14/2014,Standard Class,BH-11710,United States,Los Angeles,California,90032.0,West,OFF-AR-10002833,7.2800,4.0,0.00,1.9656,NaN,NaN,NaN

In [53]:
merged_df = pd.merge(dataset_df, dataset_dc, on='Product ID', how='inner')
merged_df

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Country,City,State,Postal Code,Region,Product ID,Sales,Quantity,Discount,Profit,Category,Sub-Category,Product Name
0,3,CA-2016-138688,6/12/2016,6/16/2016,Second Class,DV-13045,United States,Los Angeles,California,90036,West,OFF-LA-10000240,14.620,2,0.0,6.8714,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...
1,1838,CA-2014-117345,8/1/2014,8/5/2014,Standard Class,BF-10975,United States,Charlotte,North Carolina,28205,South,OFF-LA-10000240,17.544,3,0.2,5.9211,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...
2,2018,CA-2015-113110,3/19/2015,3/23/2015,Standard Class,BK-11260,United States,San Bernardino,California,92404,West,OFF-LA-10000240,14.620,2,0.0,6.8714,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...
3,2431,CA-2017-100748,5/13/2017,5/20/2017,Standard Class,RB-19795,United States,San Francisco,California,94110,West,OFF-LA-10000240,58.480,8,0.0,27.4856,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...
4,4286,CA-2015-105690,11/21/2015,11/26/2015,Second Class,CA-11965,United States,Port Arthur,Texas,77642,Central,OFF-LA-10000240,11.696,2,0.2,3.9474,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10326,9522,CA-2014-169446,12/19/2014,12/25/2014,Standard Class,SG-20605,United States,Chicago,Illinois,60623,Central,TEC-PH-10002817,323.976,3,0.2,36.4473,Technology,Phones,RCA ViSYS 25425RE1 Corded phone
10327,9563,CA-2016-129280,5/3/2016,5/5/2016,First Class,SM-20905,United States,Newark,Ohio,43055,East,TEC-MA-10003589,224.937,3,0.7,-164.9538,Technology,Machines,Cisco 8961 IP Phone Charcoal
10328,9605,CA-2015-138625,11/2/2015,11/5/2015,First Class,EG-13900,United States,Chesapeake,Virginia,23320,South,OFF-AP-10003099,197.720,4,0.0,55.3616,Office Supplies,Appliances,"Eureka Hand Vacuum, Bagless"
10329,9674,CA-2016-114867,12/23/2016,12/28/2016,Standard Class,FM-14290,United States,Philadelphia,Pennsylvania,19143,East,TEC-PH-10002645,1499.970,5,0.4,-374.9925,Technology,Phones,LG G2
10330,9936,CA-2016-114405,4/7/2016,4/12/2016,Standard Class,AS-10240,United States,Philadelphia,Pennsylvania,19120,East,OFF-ST-10001627,36.744,3,0.2,3.6744,Office Supplies,Storage,Eldon Jumbo ProFile Portable File Boxes Graphi...

## 11. Jumlah order yang berasal dari produk warna hitam (terdapat keterangan “black” di nama produknya)

In [60]:
connection1 = sqlite3.connect('merged_df.db')

In [64]:
dataset_df.to_sql("merged_df.db", connection1)

9994

In [67]:
cursor = connection1.cursor()

In [71]:
# Menghitung Total profit yang datang dari produk dengan sub category supplies
query = """
SELECT COUNT(*) AS jumlah_order_produk_hitam
FROM merged_df
WHERE "Product Name" = 'Black'
"""
pd.read_sql(query, connection1)

DatabaseError: Execution failed on sql '
SELECT COUNT(*) AS jumlah_order_produk_hitam
FROM merged_df
WHERE "Product Name" = 'Black'
': no such table: merged_df

In [72]:
jumlah_order_produk_hitam = len(merged_df[merged_df["Product Name"] == 'Black'])

# Menampilkan hasil
print(jumlah_order_produk_hitam)

0

In [73]:
# Filter DataFrame berdasarkan nama produk yang mengandung kata "black"
black_products_df = merged_df[merged_df["Product Name"].str.contains("black", case=False, na=False)]

# Menghitung jumlah order
jumlah_order_produk_hitam = len(black_products_df)

# Menampilkan hasil
print("Jumlah order produk dengan warna hitam:", jumlah_order_produk_hitam)

Jumlah order produk dengan warna hitam: 492

In [75]:
query = """
SELECT COUNT(*) AS jumlah_order_produk_hitam
FROM merged_df
WHERE LOWER("Product Name") LIKE '%black%';
"""
pd.read_sql(query, connection1)

DatabaseError: Execution failed on sql '
SELECT COUNT(*) AS jumlah_order_produk_hitam
FROM merged_df
WHERE LOWER("Product Name") LIKE '%black%';
': no such table: merged_df